frontend/controllers/ProfileController.php

SELECT * FROM `user` WHERE `username`='agalio94'
SELECT * FROM `user_profile` WHERE `user_id`=1
INSERT INTO `gallery` (`user_profile_id`, `photo`) VALUES (1, 'upload/c6dbd30bb12d9c05e49860dfa06beda7.jpg')
---
    public function actionIndex(){
             $model = User::find()->where(['username' => Yii::$app->user->identity->username])->with('userProfile')->one();
             $avatar = $model->userProfile;
             $gallery = $model->userProfile->gallery;
            if ($avatar->load(Yii::$app->request->post())) {
            $avatar->file = UploadedFile::getInstance($avatar, 'file');
            if(!empty($avatar->file)){
            $gallery = new Gallery();
            $gallery->user_profile_id = Yii::$app->user->id;
            $gallery->photo = $avatar->avatar;
            $gallery->save();

SELECT EXISTS(SELECT * FROM `user_profile` WHERE (`id`=1))
SELECT * FROM `news`
SELECT * FROM `user_profile` WHERE `id`=1
---
    public function actionNews(){
             $model = News::find()->with('userProfile')->all();

SELECT * FROM `user_profile` WHERE `user_id`=1
---
      public function actionGallery(){
        $this->layout = false;
        $model = UserProfile::find()->where(['user_id' => Yii::$app->user->id])->with('gallery')->one();